In [160]:
data = [50,50,47,97,49,3,53,42,26,74,82,62,37,15,70,27,36,35,48,52,63,64]
print (data)

[50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]

In [161]:
import numpy as np
# sert a L'analyse de donner 
grades = np.array(data)
print (grades)

[50 50 47 97 49  3 53 42 26 74 82 62 37 15 70 27 36 35 48 52 63 64]

In [162]:
print(type(data), 'x 2:,', data * 2)
print('-----')
print(type(grades), 'x 2:,', grades * 2)

<class 'list'> x 2:, [50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64, 50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]
-----
<class 'numpy.ndarray'> x 2:, [100 100  94 194  98   6 106  84  52 148 164 124  74  30 140  54  72  70
  96 104 126 128]

In [163]:
grades.shape
# shape sur un tableau 1 dimention donne seulement le nombre d'item dans le tableau

(22,)

In [164]:
grades[0]

50

In [165]:
grades.mean()
# mean() => moyenne

49.18181818181818

In [166]:
study_hours = [10.0,11.5,9.0,16.0,9.25,1.0,11.5,9.0,8.5,14.5,15.5,
              13.75,9.0,8.0,15.5,8.0,9.0,6.0,10.0,12.0,12.5,12.0]
student_data = np.array([study_hours, grades])
# initialise un tableau 2 dimention avec comme PARAM d'autre tableau
student_data
# utilisation de numpy permet d'imprimer des informations dans le print()

array([[10.  , 11.5 ,  9.  , 16.  ,  9.25,  1.  , 11.5 ,  9.  ,  8.5 ,
        14.5 , 15.5 , 13.75,  9.  ,  8.  , 15.5 ,  8.  ,  9.  ,  6.  ,
        10.  , 12.  , 12.5 , 12.  ],
       [50.  , 50.  , 47.  , 97.  , 49.  ,  3.  , 53.  , 42.  , 26.  ,
        74.  , 82.  , 62.  , 37.  , 15.  , 70.  , 27.  , 36.  , 35.  ,
        48.  , 52.  , 63.  , 64.  ]])

In [167]:
student_data.shape
# Afficher le nombre de tableau puis le nombre de tableau

(2, 22)

In [168]:
student_data[0][0] 
# vas chercher la case de tableau correspondant

10.0

In [169]:
avg_study = student_data[0].mean() 
avg_grade = student_data[1].mean()
# mean() => moyenne du tableau

print('La moyenne des heures est: {:.2f}\nMoyenne de notes: {:.2f}'.format(avg_study,avg_grade))
# {:.2f} stop apres 2 chiffres apres la virgule

La moyenne des heures est: 10.52
Moyenne de notes: 49.18

In [170]:
import pandas as pd
# sert a l'affichage des tableau et a l'analyse de donner
df_students = pd.DataFrame({'Name': ['Dan', 'Joann', 'Pedro', 'Rosie', 'Ethan', 'Vicky', 'Frederic', 'Jimmie', 'Rhonda', 'Giovanni', 'Francesca', 'Rajab', 'Naiyana', 'Kian', 'Jenny', 'Jakeem','Helena','Ismat','Anila','Skye','Daniel','Aisha'],
                            'StudyHours':student_data[0],
                            'Grade':student_data[1]})
df_students

         Name  StudyHours  Grade
0         Dan       10.00   50.0
1       Joann       11.50   50.0
2       Pedro        9.00   47.0
3       Rosie       16.00   97.0
4       Ethan        9.25   49.0
5       Vicky        1.00    3.0
6    Frederic       11.50   53.0
7      Jimmie        9.00   42.0
8      Rhonda        8.50   26.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
12    Naiyana        9.00   37.0
13       Kian        8.00   15.0
14      Jenny       15.50   70.0
15     Jakeem        8.00   27.0
16     Helena        9.00   36.0
17      Ismat        6.00   35.0
18      Anila       10.00   48.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

In [171]:
df_students.loc[5]
df_students.loc[0,'Grade']
df_students.loc[0:5]
# numpy semble ecraser le resultat precedant l'utilisation du print() permet d'afficher les deux resultats
# .loc[5] permet l'affichage d'un element de tableau pandas precis 
# .loc[0:5] permet l'affichage des éléments de 0 a 5 d'un tableau pendas
# .loc[0,'Grade'] permet l'affichage de l'element a l'index precis de la colone nomme

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0
5  Vicky        1.00    3.0

In [172]:
df_students.iloc[0:5]
df_students.iloc[0,[1,2]]
# .iloc[0:5] permet l'affichage des des 5 premiers element du tableau
# .iloc cherche jusqu'a la limite superieur du param
# .iloc peut etre utiliser comme suis
# param 1 index 
# param 2 si un tableau iras chercher l'index de tout les tableau donc [i,n]

StudyHours    10.0
Grade         50.0
Name: 0, dtype: object

In [173]:
df_students.loc[df_students['Name']=='Rosie']
df_students.query('Name=="Rosie"')
df_students[df_students['Name']=='Rosie']
df_students[df_students.Name == 'Rosie']
# Les 4 lignes afficherons le meme resultat

    Name  StudyHours  Grade
3  Rosie        16.0   97.0

In [174]:
df_students = pd.read_csv('grades.csv', delimiter=',', header='infer')
df_students.head()
# pd.read_csv permet de lire un fichier csv "excel"

UnicodeDecodeError: 'utf-8' codec can't decode byte 0x90 in position 22: invalid start byte

In [ ]:
df_students.isnull().sum()
# permet de recuperer le nombre de donner qui sont null "vide"

Name          0
StudyHours    0
Grade         0
dtype: int64

In [ ]:
df_students[df_students.isnull().any(axis=1)]
# permet d'afficher les donner qui sont null "vide"

Empty DataFrame
Columns: [Name, StudyHours, Grade]
Index: []

In [ ]:
mean_study = df_students['StudyHours'].mean()
mean_grade = df_students.Grade.mean()

print('Moyenne d\'heure d\'etude {:.2f}\nMoyenne des notes: {:.2f}'.format(mean_study,mean_grade))

Moyenne d'heure d'etude 10.52
Moyenne des notes: 49.18

In [ ]:
df_students[df_students.StudyHours >= mean_study]
# affiche les resultats qui sont au dessus de la moyenne d'etude

         Name  StudyHours  Grade
1       Joann       11.50   50.0
3       Rosie       16.00   97.0
6    Frederic       11.50   53.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
14      Jenny       15.50   70.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

In [ ]:
df_students[df_students.StudyHours >= mean_study].Grade.mean()
# affiche la moyenne des resultats qui sont au dessus de la moyenne total

66.7

In [175]:
passes =  pd.Series(df_students['Grade'] >= 60)
df_students = pd.concat([df_students,passes.rename('Pass')], axis=1)
df_students
# ajoute la colone pass avec comme result true ou false si le grade est sup||egal a 60

         Name  StudyHours  Grade   Pass
0         Dan       10.00   50.0  False
1       Joann       11.50   50.0  False
2       Pedro        9.00   47.0  False
3       Rosie       16.00   97.0   True
4       Ethan        9.25   49.0  False
5       Vicky        1.00    3.0  False
6    Frederic       11.50   53.0  False
7      Jimmie        9.00   42.0  False
8      Rhonda        8.50   26.0  False
9    Giovanni       14.50   74.0   True
10  Francesca       15.50   82.0   True
11      Rajab       13.75   62.0   True
12    Naiyana        9.00   37.0  False
13       Kian        8.00   15.0  False
14      Jenny       15.50   70.0   True
15     Jakeem        8.00   27.0  False
16     Helena        9.00   36.0  False
17      Ismat        6.00   35.0  False
18      Anila       10.00   48.0  False
19       Skye       12.00   52.0  False
20     Daniel       12.50   63.0   True
21      Aisha       12.00   64.0   True

In [176]:
print(df_students.groupby(df_students.Pass)[['StudyHours', 'Grade']].mean())
# print la moyenne des resultats par rapport a la colone Pass

       StudyHours      Grade
Pass
False    8.783333  38.000000
True    14.250000  73.142857

In [177]:
df_students = df_students.sort_values('Grade', ascending=False)
df_students
# trie le tableau

         Name  StudyHours  Grade   Pass
3       Rosie       16.00   97.0   True
10  Francesca       15.50   82.0   True
9    Giovanni       14.50   74.0   True
14      Jenny       15.50   70.0   True
21      Aisha       12.00   64.0   True
20     Daniel       12.50   63.0   True
11      Rajab       13.75   62.0   True
6    Frederic       11.50   53.0  False
19       Skye       12.00   52.0  False
1       Joann       11.50   50.0  False
0         Dan       10.00   50.0  False
4       Ethan        9.25   49.0  False
18      Anila       10.00   48.0  False
2       Pedro        9.00   47.0  False
7      Jimmie        9.00   42.0  False
12    Naiyana        9.00   37.0  False
16     Helena        9.00   36.0  False
17      Ismat        6.00   35.0  False
15     Jakeem        8.00   27.0  False
8      Rhonda        8.50   26.0  False
13       Kian        8.00   15.0  False
5       Vicky        1.00    3.0  False